Revit 2027 API
RailingPathCurveJoinOption Enumeration
 The join type of the railing path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RailingPathCurveJoinOption
Public Enumeration RailingPathCurveJoinOption
public enum class RailingPathCurveJoinOption
type RailingPathCurveJoinOption
Members
Member name | Value | Description
AddVerticalOrHorizontalSegments | 2 |  Add vertical or horizontal segments.
ByType | 0 |  The rails will be joined according to the settings in the rail type.
ExtendRailsToMeet | 1 |  Extend rails to meet.
NoConnector | 3 |  No connector.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace